#pragma once
#include "Vector.h"

//================================================
// Matrix4x4行列
//================================================
struct Matrix4x4 final {
	float m[4][4];
};

//================================================
// Matrix4x4行列の積
//================================================
Matrix4x4 Multiply(const Matrix4x4& m1, const Matrix4x4& m2);

//================================================
// Matrix4x4行列の逆行列zz
//================================================
Matrix4x4 Inverse(const Matrix4x4& m);

//================================================
// Matrix4x4の単位行列
//================================================
Matrix4x4 MakeIdentity4x4();

//================================================
// Matrix4x4の拡縮行列
//================================================
Matrix4x4 MakeScaleMatrix(const Vector3& scale);

//================================================
// Matrix4x4のx軸回転行列
//================================================
Matrix4x4 MakePitchMatrix(float radian);

//================================================
// Matrix4x4のy軸回転行列
//================================================
Matrix4x4 MakeYawMatrix(float radian);

//================================================
// Matrix4x4のz軸回転行列
//================================================
Matrix4x4 MakeRollMatrix(float radian);

//================================================
// Matrix4x4の回転行列
//================================================
Matrix4x4 MakeRotateMatrix(const Vector3& rotate);

//================================================
// Matrix4x4の平行移動行列
//================================================
Matrix4x4 MakeTranslateMatrix(const Vector3& translate);

//================================================
// Matrix4x4のアフィン変換
//================================================
Matrix4x4 MakeAffineMatrix(const Vector3& scale, const Vector3& rotate, const Vector3& translate);

//================================================
// 正射影行列
//================================================
Matrix4x4 MakeOrthographicMatrix(float left, float top, float right, float bottom, float nearClip, float farClip);